[Killed] BlockStatement
src/services/claude.client.js:29:30
   minCalls:           10,
   windowMs:           60_000,
   openDurationMs:     60_000,
-  onStateChange(state, name) {
-    log.warn({ provider: name, state }, `Circuit breaker → ${state}`);
-    setCircuitState(name, state);
-  },
+  onStateChange(state, name) {},
 });
 
killedBy: onStateChange callback (L29-33 killers) calls setCircuitState(name, newState) on state change (L29 BlockStatement)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "OPEN"

Number of calls: 0

[Killed] ObjectLiteral
src/services/claude.client.js:30:14
   windowMs:           60_000,
   openDurationMs:     60_000,
   onStateChange(state, name) {
-    log.warn({ provider: name, state }, `Circuit breaker → ${state}`);
+    log.warn({}, `Circuit breaker → ${state}`);
     setCircuitState(name, state);
   },
killedBy: onStateChange callback (L29-33 killers) includes { provider, state } in log.warn (L30 ObjectLiteral)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"provider": "claude", "state": "HALF_OPEN"}, Any<String>
Received: {}, "Circuit breaker → HALF_OPEN"

Number of calls: 1

[Killed] StringLiteral
src/services/claude.client.js:36:17
 });
 
 // Initialise gauge to CLOSED on startup
-setCircuitState('claude', STATE.CLOSED);
+setCircuitState("", STATE.CLOSED);
 
 // ── Helpers ───────────────────────────────────────────────────────────────────
killedBy: Module init — StringLiteral "claude" killers setCircuitState("claude", "CLOSED") called on module load (L36)
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: ["claude", "CLOSED"]
Received array: [["", "CLOSED"]]

[Killed] BlockStatement
src/services/claude.client.js:40:22
 
 // ── Helpers ───────────────────────────────────────────────────────────────────
 
-function _escJson(s) {
-  return String(s).replace(/\\/g, '\\\\').replace(/"/g, '\\"').replace(/\n/g, '\\n');
-}
+function _escJson(s) {}
 
 /* c8 ignore next 4 — withRetry is mocked in all test suites; _isRetryable is internal and unreachable via the public API in tests */
killedBy: _escJson special-char escaping (L40-41 killers) double-quote in text is escaped as \" in content (L41 StringLiteral \")
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\\\"urgent\\\""
Received string:    "Texte à analyser : \"undefined\""

[Killed] StringLiteral
src/services/claude.client.js:41:35
 // ── Helpers ───────────────────────────────────────────────────────────────────
 
 function _escJson(s) {
-  return String(s).replace(/\\/g, '\\\\').replace(/"/g, '\\"').replace(/\n/g, '\\n');
+  return String(s).replace(/\\/g, "").replace(/"/g, '\\"').replace(/\n/g, '\\n');
 }
 
killedBy: _escJson special-char escaping (L40-41 killers) backslash in text is doubled in content (L41 StringLiteral \\)
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\\\\"
Received string:    "Texte à analyser : \"pathto meeting\""

[Killed] BlockStatement
src/services/claude.client.js:45:28
 }
 
 /* c8 ignore next 4 — withRetry is mocked in all test suites; _isRetryable is internal and unreachable via the public API in tests */
-function _isRetryable(err) {
-  if (err instanceof CircuitOpenError) return false;
-  if (err instanceof HttpError && err.status >= 400 && err.status < 500) return false;
-  return true;
-}
+function _isRetryable(err) {}
 
 function _failureReason(err) {
killedBy: _isRetryable — retry count killers (L45-48) HttpError 5xx IS retried: exec called 3 times (1 + 2 retries)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 1

[Killed] ConditionalExpression
src/services/claude.client.js:46:7
 
 /* c8 ignore next 4 — withRetry is mocked in all test suites; _isRetryable is internal and unreachable via the public API in tests */
 function _isRetryable(err) {
-  if (err instanceof CircuitOpenError) return false;
+  if (false) return false;
   if (err instanceof HttpError && err.status >= 400 && err.status < 500) return false;
   return true;
killedBy: _isRetryable — retry count killers (L45-48) CircuitOpenError is NOT retried: exec called exactly 1 time
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 3

[Killed] ConditionalExpression
src/services/claude.client.js:46:7
 
 /* c8 ignore next 4 — withRetry is mocked in all test suites; _isRetryable is internal and unreachable via the public API in tests */
 function _isRetryable(err) {
-  if (err instanceof CircuitOpenError) return false;
+  if (true) return false;
   if (err instanceof HttpError && err.status >= 400 && err.status < 500) return false;
   return true;
killedBy: _isRetryable — retry count killers (L45-48) HttpError 5xx IS retried: exec called 3 times (1 + 2 retries)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 1

[Killed] BooleanLiteral
src/services/claude.client.js:47:81
 /* c8 ignore next 4 — withRetry is mocked in all test suites; _isRetryable is internal and unreachable via the public API in tests */
 function _isRetryable(err) {
   if (err instanceof CircuitOpenError) return false;
-  if (err instanceof HttpError && err.status >= 400 && err.status < 500) return false;
+  if (err instanceof HttpError && err.status >= 400 && err.status < 500) return true;
   return true;
 }
killedBy: _call — HttpError when res.ok is false (lines 88-89) recordFailure called with http_4xx on 422
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "http_4xx"

Number of calls: 0

[Killed] ConditionalExpression
src/services/claude.client.js:47:7
 /* c8 ignore next 4 — withRetry is mocked in all test suites; _isRetryable is internal and unreachable via the public API in tests */
 function _isRetryable(err) {
   if (err instanceof CircuitOpenError) return false;
-  if (err instanceof HttpError && err.status >= 400 && err.status < 500) return false;
+  if (true) return false;
   return true;
 }
killedBy: _isRetryable — retry count killers (L45-48) HttpError 5xx IS retried: exec called 3 times (1 + 2 retries)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 1

[Killed] BooleanLiteral
src/services/claude.client.js:48:10
 function _isRetryable(err) {
   if (err instanceof CircuitOpenError) return false;
   if (err instanceof HttpError && err.status >= 400 && err.status < 500) return false;
-  return true;
+  return false;
 }
 
killedBy: _isRetryable — retry count killers (L45-48) HttpError 5xx IS retried: exec called 3 times (1 + 2 retries)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 1

[Killed] BlockStatement
src/services/claude.client.js:51:30
   return true;
 }
 
-function _failureReason(err) {
-  if (err instanceof CircuitOpenError) return 'circuit_open';
-  if (err instanceof TimeoutError)     return 'timeout';
-  if (err instanceof HttpError)        return err.status >= 500 ? 'http_5xx' : 'http_4xx';
-  return 'network';
-}
+function _failureReason(err) {}
 
 function _requestStatus(err) {
killedBy: _failureReason string killers (L52-55) CircuitOpenError → recordFailure("circuit_open")
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "circuit_open"
Received: "claude", undefined

Number of calls: 1

[Killed] ConditionalExpression
src/services/claude.client.js:52:7
 }
 
 function _failureReason(err) {
-  if (err instanceof CircuitOpenError) return 'circuit_open';
+  if (false) return 'circuit_open';
   if (err instanceof TimeoutError)     return 'timeout';
   if (err instanceof HttpError)        return err.status >= 500 ? 'http_5xx' : 'http_4xx';
killedBy: _failureReason string killers (L52-55) CircuitOpenError → recordFailure("circuit_open")
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "circuit_open"
Received: "claude", "network"

Number of calls: 1

[Killed] ConditionalExpression
src/services/claude.client.js:52:7
 }
 
 function _failureReason(err) {
-  if (err instanceof CircuitOpenError) return 'circuit_open';
+  if (true) return 'circuit_open';
   if (err instanceof TimeoutError)     return 'timeout';
   if (err instanceof HttpError)        return err.status >= 500 ? 'http_5xx' : 'http_4xx';
killedBy: _call — HttpError when res.ok is false (lines 88-89) recordFailure called with http_4xx on 422
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "http_4xx"
Received: "claude", "circuit_open"

Number of calls: 1

[Killed] ConditionalExpression
src/services/claude.client.js:53:7
 
 function _failureReason(err) {
   if (err instanceof CircuitOpenError) return 'circuit_open';
-  if (err instanceof TimeoutError)     return 'timeout';
+  if (true)     return 'timeout';
   if (err instanceof HttpError)        return err.status >= 500 ? 'http_5xx' : 'http_4xx';
   return 'network';
killedBy: CircuitOpenError paths — lines 44, 51, 57 call 1: 3 network failures (consecutive count reaches 3)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "network"
Received: "claude", "timeout"

Number of calls: 1

[Killed] ConditionalExpression
src/services/claude.client.js:53:7
 
 function _failureReason(err) {
   if (err instanceof CircuitOpenError) return 'circuit_open';
-  if (err instanceof TimeoutError)     return 'timeout';
+  if (false)     return 'timeout';
   if (err instanceof HttpError)        return err.status >= 500 ? 'http_5xx' : 'http_4xx';
   return 'network';
killedBy: TimeoutError branches — lines 51, 58 all 3 attempts timeout → TimeoutError reaches _failureReason and _requestStatus
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "timeout"
Received: "claude", "network"

Number of calls: 1

[Killed] EqualityOperator
src/services/claude.client.js:54:47
 function _failureReason(err) {
   if (err instanceof CircuitOpenError) return 'circuit_open';
   if (err instanceof TimeoutError)     return 'timeout';
-  if (err instanceof HttpError)        return err.status >= 500 ? 'http_5xx' : 'http_4xx';
+  if (err instanceof HttpError)        return err.status > 500 ? 'http_5xx' : 'http_4xx';
   return 'network';
 }
killedBy: _failureReason http_5xx — line 52 branch 6,0 HTTP 500 response → http_5xx failure reason (all 3 attempts fail)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "http_5xx"
Received: "claude", "http_4xx"

Number of calls: 1

[Killed] EqualityOperator
src/services/claude.client.js:54:47
 function _failureReason(err) {
   if (err instanceof CircuitOpenError) return 'circuit_open';
   if (err instanceof TimeoutError)     return 'timeout';
-  if (err instanceof HttpError)        return err.status >= 500 ? 'http_5xx' : 'http_4xx';
+  if (err instanceof HttpError)        return err.status < 500 ? 'http_5xx' : 'http_4xx';
   return 'network';
 }
killedBy: _call — HttpError when res.ok is false (lines 88-89) recordFailure called with http_4xx on 422
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "http_4xx"
Received: "claude", "http_5xx"

Number of calls: 1

[Killed] BlockStatement
src/services/claude.client.js:58:30
   return 'network';
 }
 
-function _requestStatus(err) {
-  if (err instanceof CircuitOpenError) return 'circuit_open';
-  if (err instanceof TimeoutError)     return 'timeout';
-  return 'error';
-}
+function _requestStatus(err) {}
 
 // ── Low-level API call ────────────────────────────────────────────────────────
killedBy: _requestStatus string killers (L58-62) CircuitOpenError → recordRequest("circuit_open")
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "circuit_open"
Received: "claude", undefined

Number of calls: 1

[Timeout] ConditionalExpression
src/services/claude.client.js:59:7
 }
 
 function _requestStatus(err) {
-  if (err instanceof CircuitOpenError) return 'circuit_open';
+  if (true) return 'circuit_open';
   if (err instanceof TimeoutError)     return 'timeout';
   return 'error';

[Timeout] ConditionalExpression
src/services/claude.client.js:59:7
 }
 
 function _requestStatus(err) {
-  if (err instanceof CircuitOpenError) return 'circuit_open';
+  if (false) return 'circuit_open';
   if (err instanceof TimeoutError)     return 'timeout';
   return 'error';

[Killed] BlockStatement
src/services/claude.client.js:76:13
 
   try {
     const result = await withRetry(
-      () => {
-        attempts++;
-        return breaker.exec(
-          async (signal) => {
-            const res = await apiFetch('https://api.anthropic.com/v1/messages', {
-              method:  'POST',
-              headers: {
-                'Content-Type':      'application/json',
-                'x-api-key':         config.CLAUDE_API_KEY,
-                'anthropic-version': '2023-06-01',
-              },
-              body:   JSON.stringify(body),
-              signal,
-            });
-
-            if (!res.ok) {
-              const detail = await res.text().catch(() => '');
-              throw new HttpError(res.status, `Claude ${res.status}: ${detail.slice(0, 200)}`);
-            }
-            return res.json();
-          },
-          { requestId, timeoutMs: 30_000 },
-        );
-      },
+      () => {},
       { maxRetries: 2, shouldRetry: _isRetryable },
     );
killedBy: analyze — Claude API success returns parsed intent from Claude response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Dentiste"
Received: ""

[Survived] UpdateOperator
src/services/claude.client.js:77:9
   try {
     const result = await withRetry(
       () => {
-        attempts++;
+        attempts--;
         return breaker.exec(
           async (signal) => {

[Killed] BlockStatement
src/services/claude.client.js:79:29
       () => {
         attempts++;
         return breaker.exec(
-          async (signal) => {
-            const res = await apiFetch('https://api.anthropic.com/v1/messages', {
-              method:  'POST',
-              headers: {
-                'Content-Type':      'application/json',
-                'x-api-key':         config.CLAUDE_API_KEY,
-                'anthropic-version': '2023-06-01',
-              },
-              body:   JSON.stringify(body),
-              signal,
-            });
-
-            if (!res.ok) {
-              const detail = await res.text().catch(() => '');
-              throw new HttpError(res.status, `Claude ${res.status}: ${detail.slice(0, 200)}`);
-            }
-            return res.json();
-          },
+          async (signal) => {},
           { requestId, timeoutMs: 30_000 },
         );
killedBy: TimeoutError branches — lines 51, 58 all 3 attempts timeout → TimeoutError reaches _failureReason and _requestStatus
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "timeout"

Number of calls: 0

[Killed] StringLiteral
src/services/claude.client.js:80:40
         attempts++;
         return breaker.exec(
           async (signal) => {
-            const res = await apiFetch('https://api.anthropic.com/v1/messages', {
+            const res = await apiFetch("", {
               method:  'POST',
               headers: {
killedBy: _call API headers and URL (L79-84 killers) apiFetch called with Anthropic API URL (L79)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://api.anthropic.com/v1/messages", Any<Object>

Number of calls: 1

[Killed] StringLiteral
src/services/claude.client.js:85:38
               headers: {
                 'Content-Type':      'application/json',
                 'x-api-key':         config.CLAUDE_API_KEY,
-                'anthropic-version': '2023-06-01',
+                'anthropic-version': "",
               },
               body:   JSON.stringify(body),
killedBy: _call API headers and URL (L79-84 killers) anthropic-version header is set (L84)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2023-06-01"
Received: ""

[Killed] ConditionalExpression
src/services/claude.client.js:91:17
               signal,
             });
 
-            if (!res.ok) {
+            if (true) {
               const detail = await res.text().catch(() => '');
               throw new HttpError(res.status, `Claude ${res.status}: ${detail.slice(0, 200)}`);
killedBy: Metrics call shape (L96/L97/L105/L113 ObjectLiteral killers) recordRequest called with "success" string (L105 StringLiteral)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "success"
Received: "claude", "error"

Number of calls: 1

[Killed] BlockStatement
src/services/claude.client.js:91:26
               signal,
             });
 
-            if (!res.ok) {
-              const detail = await res.text().catch(() => '');
-              throw new HttpError(res.status, `Claude ${res.status}: ${detail.slice(0, 200)}`);
-            }
+            if (!res.ok) {}
             return res.json();
           },
killedBy: _call — HttpError when res.ok is false (lines 88-89) recordFailure called with http_4xx on 422
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "http_4xx"

Number of calls: 0

[Killed] ArrowFunction
src/services/claude.client.js:92:53
             });
 
             if (!res.ok) {
-              const detail = await res.text().catch(() => '');
+              const detail = await res.text().catch(() => undefined);
               throw new HttpError(res.status, `Claude ${res.status}: ${detail.slice(0, 200)}`);
             }
killedBy: _call — HttpError when res.ok is false (lines 88-89) res.text() error in HttpError path does not crash
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rule-based"
Received: "claude"

[Survived] MethodExpression
src/services/claude.client.js:93:72
 
             if (!res.ok) {
               const detail = await res.text().catch(() => '');
-              throw new HttpError(res.status, `Claude ${res.status}: ${detail.slice(0, 200)}`);
+              throw new HttpError(res.status, `Claude ${res.status}: ${detail}`);
             }
             return res.json();

[Killed] ArithmeticOperator
src/services/claude.client.js:103:21
       { maxRetries: 2, shouldRetry: _isRetryable },
     );
 
-    const latency = Date.now() - start;
+    const latency = Date.now() + start;
     recordRequest('claude', 'success');
     recordLatency('claude', latency);
killedBy: Metrics call shape (L96/L97/L105/L113 ObjectLiteral killers) recordLatency called with a non-negative number < 10s (L102 ArithmeticOperator)
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 10000
Received:   3558433503184

[Killed] BlockStatement
src/services/claude.client.js:109:17
     log.debug({ requestId, latency, attempts, state: breaker.getState() }, 'Claude OK');
     return result;
 
-  } catch (err) {
-    const latency = Date.now() - start;
-    recordRequest('claude', _requestStatus(err));
-    recordFailure('claude', _failureReason(err));
-    recordLatency('claude', latency);
-    log.warn({
-      requestId, latency, attempts,
-      state: breaker.getState(),
-      err:   err.message,
-    }, 'Claude request failed');
-    throw err;
-  }
+  } catch (err) {}
 }
 
killedBy: _call — HttpError when res.ok is false (lines 88-89) recordFailure called with http_4xx on 422
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "http_4xx"

Number of calls: 0

[Killed] ArithmeticOperator
src/services/claude.client.js:110:21
     return result;
 
   } catch (err) {
-    const latency = Date.now() - start;
+    const latency = Date.now() + start;
     recordRequest('claude', _requestStatus(err));
     recordFailure('claude', _failureReason(err));
killedBy: Metrics call shape (L96/L97/L105/L113 ObjectLiteral killers) failure path recordLatency also reasonable (L109 ArithmeticOperator)
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 10000
Received:   3558433579846

[Survived] StringLiteral
src/services/claude.client.js:113:19
     const latency = Date.now() - start;
     recordRequest('claude', _requestStatus(err));
     recordFailure('claude', _failureReason(err));
-    recordLatency('claude', latency);
+    recordLatency("", latency);
     log.warn({
       requestId, latency, attempts,

[Survived] ObjectLiteral
src/services/claude.client.js:114:14
     recordRequest('claude', _requestStatus(err));
     recordFailure('claude', _failureReason(err));
     recordLatency('claude', latency);
-    log.warn({
-      requestId, latency, attempts,
-      state: breaker.getState(),
-      err:   err.message,
-    }, 'Claude request failed');
+    log.warn({}, 'Claude request failed');
     throw err;
   }

[Killed] MethodExpression
src/services/claude.client.js:126:17
 // ── Rule-based fallback (no API key / circuit open) ───────────────────────────
 
 function _ruleBased(text) {
-  const lower = text.toLowerCase();
+  const lower = text.toUpperCase();
   let intent = 'unknown';
   if (/cr(ee|ée|éer|eer|e un|ajoute)|planif|book|schedul/.test(lower)) intent = 'create_event';
killedBy: _ruleBased update_event regex (L129 killer) "modifier" triggers update_event
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "update_event"
Received: "unknown"

[Killed] ConditionalExpression
src/services/claude.client.js:128:7
 function _ruleBased(text) {
   const lower = text.toLowerCase();
   let intent = 'unknown';
-  if (/cr(ee|ée|éer|eer|e un|ajoute)|planif|book|schedul/.test(lower)) intent = 'create_event';
+  if (false) intent = 'create_event';
   else if (/annul|supprim|effac|retir|delet/.test(lower))               intent = 'cancel_event';
   else if (/modif|change|d[eé]place|replan|repouss/.test(lower))        intent = 'update_event';
killedBy: INVARIANT 5: keyword → intent mapping is deterministic "créer un rendez-vous" → intent="create_event"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "create_event"
Received: "unknown"

[Killed] ConditionalExpression
src/services/claude.client.js:128:7
 function _ruleBased(text) {
   const lower = text.toLowerCase();
   let intent = 'unknown';
-  if (/cr(ee|ée|éer|eer|e un|ajoute)|planif|book|schedul/.test(lower)) intent = 'create_event';
+  if (true) intent = 'create_event';
   else if (/annul|supprim|effac|retir|delet/.test(lower))               intent = 'cancel_event';
   else if (/modif|change|d[eé]place|replan|repouss/.test(lower))        intent = 'update_event';
killedBy: _ruleBased update_event regex (L129 killer) "modifier" triggers update_event
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "update_event"
Received: "create_event"

[Killed] ConditionalExpression
src/services/claude.client.js:129:12
   const lower = text.toLowerCase();
   let intent = 'unknown';
   if (/cr(ee|ée|éer|eer|e un|ajoute)|planif|book|schedul/.test(lower)) intent = 'create_event';
-  else if (/annul|supprim|effac|retir|delet/.test(lower))               intent = 'cancel_event';
+  else if (true)               intent = 'cancel_event';
   else if (/modif|change|d[eé]place|replan|repouss/.test(lower))        intent = 'update_event';
   else if (/liste|quels|quoi|affich|show|display/.test(lower))          intent = 'list_events';
killedBy: _ruleBased update_event regex (L129 killer) "modifier" triggers update_event
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "update_event"
Received: "cancel_event"

[Timeout] ConditionalExpression
src/services/claude.client.js:129:12
   const lower = text.toLowerCase();
   let intent = 'unknown';
   if (/cr(ee|ée|éer|eer|e un|ajoute)|planif|book|schedul/.test(lower)) intent = 'create_event';
-  else if (/annul|supprim|effac|retir|delet/.test(lower))               intent = 'cancel_event';
+  else if (false)               intent = 'cancel_event';
   else if (/modif|change|d[eé]place|replan|repouss/.test(lower))        intent = 'update_event';
   else if (/liste|quels|quoi|affich|show|display/.test(lower))          intent = 'list_events';

[Killed] ConditionalExpression
src/services/claude.client.js:130:12
   let intent = 'unknown';
   if (/cr(ee|ée|éer|eer|e un|ajoute)|planif|book|schedul/.test(lower)) intent = 'create_event';
   else if (/annul|supprim|effac|retir|delet/.test(lower))               intent = 'cancel_event';
-  else if (/modif|change|d[eé]place|replan|repouss/.test(lower))        intent = 'update_event';
+  else if (true)        intent = 'update_event';
   else if (/liste|quels|quoi|affich|show|display/.test(lower))          intent = 'list_events';
 
killedBy: analyze — no API key → rule-based detects list_events from "liste"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "list_events"
Received: "update_event"

[Killed] ConditionalExpression
src/services/claude.client.js:130:12
   let intent = 'unknown';
   if (/cr(ee|ée|éer|eer|e un|ajoute)|planif|book|schedul/.test(lower)) intent = 'create_event';
   else if (/annul|supprim|effac|retir|delet/.test(lower))               intent = 'cancel_event';
-  else if (/modif|change|d[eé]place|replan|repouss/.test(lower))        intent = 'update_event';
+  else if (false)        intent = 'update_event';
   else if (/liste|quels|quoi|affich|show|display/.test(lower))          intent = 'list_events';
 
killedBy: INVARIANT 5: keyword → intent mapping is deterministic "modifier mon rendez-vous" → intent="update_event"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "update_event"
Received: "unknown"

[Killed] ConditionalExpression
src/services/claude.client.js:131:12
   if (/cr(ee|ée|éer|eer|e un|ajoute)|planif|book|schedul/.test(lower)) intent = 'create_event';
   else if (/annul|supprim|effac|retir|delet/.test(lower))               intent = 'cancel_event';
   else if (/modif|change|d[eé]place|replan|repouss/.test(lower))        intent = 'update_event';
-  else if (/liste|quels|quoi|affich|show|display/.test(lower))          intent = 'list_events';
+  else if (false)          intent = 'list_events';
 
   const mTime    = lower.match(/(\d{1,2})[h:](\d{0,2})/);
killedBy: INVARIANT 5: keyword → intent mapping is deterministic "liste mes rendez-vous" → intent="list_events"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "list_events"
Received: "unknown"

[Timeout] ConditionalExpression
src/services/claude.client.js:131:12
   if (/cr(ee|ée|éer|eer|e un|ajoute)|planif|book|schedul/.test(lower)) intent = 'create_event';
   else if (/annul|supprim|effac|retir|delet/.test(lower))               intent = 'cancel_event';
   else if (/modif|change|d[eé]place|replan|repouss/.test(lower))        intent = 'update_event';
-  else if (/liste|quels|quoi|affich|show|display/.test(lower))          intent = 'list_events';
+  else if (true)          intent = 'list_events';
 
   const mTime    = lower.match(/(\d{1,2})[h:](\d{0,2})/);

[Killed] ConditionalExpression
src/services/claude.client.js:134:44
   else if (/liste|quels|quoi|affich|show|display/.test(lower))          intent = 'list_events';
 
   const mTime    = lower.match(/(\d{1,2})[h:](\d{0,2})/);
-  const time     = mTime ? `${mTime[1]}:${(mTime[2] || '00').padStart(2, '0')}` : '';
+  const time     = mTime ? `${mTime[1]}:${(false).padStart(2, '0')}` : '';
   const mDate    = lower.match(/(aujourd'hui|demain|lundi|mardi|mercredi|jeudi|vendredi|samedi|dimanche|\d{1,2}\/\d{1,2})/);
   let   date     = '';
killedBy: _ruleBased update_event regex (L129 killer) "repouss" triggers update_event
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).padStart is not a function

[Killed] LogicalOperator
src/services/claude.client.js:134:44
   else if (/liste|quels|quoi|affich|show|display/.test(lower))          intent = 'list_events';
 
   const mTime    = lower.match(/(\d{1,2})[h:](\d{0,2})/);
-  const time     = mTime ? `${mTime[1]}:${(mTime[2] || '00').padStart(2, '0')}` : '';
+  const time     = mTime ? `${mTime[1]}:${(mTime[2] && '00').padStart(2, '0')}` : '';
   const mDate    = lower.match(/(aujourd'hui|demain|lundi|mardi|mercredi|jeudi|vendredi|samedi|dimanche|\d{1,2}\/\d{1,2})/);
   let   date     = '';
killedBy: analyze — no API key → rule-based extracts time "14h30"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "14:30"
Received: "14:00"

[Killed] Regex
src/services/claude.client.js:135:32
 
   const mTime    = lower.match(/(\d{1,2})[h:](\d{0,2})/);
   const time     = mTime ? `${mTime[1]}:${(mTime[2] || '00').padStart(2, '0')}` : '';
-  const mDate    = lower.match(/(aujourd'hui|demain|lundi|mardi|mercredi|jeudi|vendredi|samedi|dimanche|\d{1,2}\/\d{1,2})/);
+  const mDate    = lower.match(/(aujourd'hui|demain|lundi|mardi|mercredi|jeudi|vendredi|samedi|dimanche|\d\/\d{1,2})/);
   let   date     = '';
   if (mDate) {
killedBy: analyze — no API key → rule-based extracts DD/MM date
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^\d{4}-06-15$/
Received string:  "2026-06-05"
