[Killed] ArithmeticOperator
src/features/auth/token.service.js:14:21
 const log = childLogger('auth');
 
 const ACCESS_TTL  = 15 * 60;       // 15 min (seconds)
-const REFRESH_TTL = 7 * 24 * 3600; // 7 days
+const REFRESH_TTL = 7 / 24 * 3600; // 7 days
 
 /**
killedBy: issueTokens — refresh token jwt options (L31 ObjectLiteral killer) refresh token expires ~7 days from now
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1779822744
Received:    1779218999

[Killed] LogicalOperator
src/features/auth/token.service.js:22:42
  * @returns {{ accessToken: string, refreshToken: string, expiresIn: number }}
  */
 export async function issueTokens(payload) {
-  const base = { sub: payload.sub, role: payload.role ?? 'user' };
+  const base = { sub: payload.sub, role: payload.role && 'user' };
 
   const accessToken = jwt.sign(base, config.JWT_SECRET, {
killedBy: issueTokens accessToken contains sub and role claims
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "admin"
Received: "user"

[Killed] ObjectLiteral
src/features/auth/token.service.js:22:16
  * @returns {{ accessToken: string, refreshToken: string, expiresIn: number }}
  */
 export async function issueTokens(payload) {
-  const base = { sub: payload.sub, role: payload.role ?? 'user' };
+  const base = {};
 
   const accessToken = jwt.sign(base, config.JWT_SECRET, {
killedBy: issueTokens accessToken contains sub and role claims
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-42"
Received: undefined

[Killed] ObjectLiteral
src/features/auth/token.service.js:24:57
 export async function issueTokens(payload) {
   const base = { sub: payload.sub, role: payload.role ?? 'user' };
 
-  const accessToken = jwt.sign(base, config.JWT_SECRET, {
-    expiresIn: ACCESS_TTL,
-    algorithm: 'HS256',
-  });
+  const accessToken = jwt.sign(base, config.JWT_SECRET, {});
 
   // Create a refresh token with a jti and store the jti in Redis for revocation checks.
killedBy: issueTokens — access token jwt options (L24 ObjectLiteral killer) access token has exp claim (expiresIn enforced)
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ObjectLiteral
src/features/auth/token.service.js:31:33
 
   // Create a refresh token with a jti and store the jti in Redis for revocation checks.
   const jti = crypto.randomUUID();
-  const refreshToken = jwt.sign({ sub: payload.sub, jti }, config.JWT_REFRESH_SECRET, {
+  const refreshToken = jwt.sign({}, config.JWT_REFRESH_SECRET, {
     expiresIn: REFRESH_TTL,
     algorithm: 'HS256',
killedBy: refreshTokens cache validation log.warn (L72 killers) log.warn includes { err } when cacheGet throws (L72 ObjectLiteral)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Cache unavailable"
Received message:   "Missing refresh token id"

      148 |
      149 |     // Verify jti still valid (not revoked)
    > 150 |     if (stryMutAct_9fa48("32") ? false : stryMutAct_9fa48("31") ? true : stryMutAct_9fa48("30") ? payload.jti : (stryCov_9fa48("30", "31", "32"), !payload.jti)) throw new Error(stry

[Killed] BlockStatement
src/features/auth/token.service.js:36:7
     algorithm: 'HS256',
   });
 
-  try {
-    await cacheSet(`rt:${jti}`, '1', REFRESH_TTL);
-  } catch (err) {
+  try {} catch (err) {
     // Best-effort: if cache unavailable, proceed but log.
     log.warn({ err: err.message }, 'Failed to persist refresh token jti');
killedBy: issueTokens cacheSet failure logging (L38 BlockStatement killer) log.warn called when cacheSet throws (L38 BlockStatement)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/features/auth/token.service.js:37:33
   });
 
   try {
-    await cacheSet(`rt:${jti}`, '1', REFRESH_TTL);
+    await cacheSet(`rt:${jti}`, "", REFRESH_TTL);
   } catch (err) {
     // Best-effort: if cache unavailable, proceed but log.
killedBy: POST /auth/refresh issues new accessToken with valid refresh cookie
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BlockStatement
src/features/auth/token.service.js:38:17
 
   try {
     await cacheSet(`rt:${jti}`, '1', REFRESH_TTL);
-  } catch (err) {
-    // Best-effort: if cache unavailable, proceed but log.
-    log.warn({ err: err.message }, 'Failed to persist refresh token jti');
-  }
+  } catch (err) {}
 
   log.info({ sub: payload.sub, role: base.role }, 'Tokens issued');
killedBy: issueTokens cacheSet failure logging (L38 BlockStatement killer) log.warn called when cacheSet throws (L38 BlockStatement)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/features/auth/token.service.js:53:37
  * @returns {{ sub: string, role: string }}
  * @throws {jwt.JsonWebTokenError | jwt.TokenExpiredError}
  */
-export function verifyAccess(token) {
-  return jwt.verify(token, config.JWT_SECRET, { algorithms: ['HS256'] });
-}
+export function verifyAccess(token) {}
 
 /**
killedBy: issueTokens — access token jwt options (L24 ObjectLiteral killer) access token signed with HS256 — HS384 token is REJECTED (algorithm enforced)
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] StringLiteral
src/features/auth/token.service.js:63:79
  * @returns {{ accessToken: string, refreshToken: string, expiresIn: number }}
  */
 export async function refreshTokens(token) {
-  const payload = jwt.verify(token, config.JWT_REFRESH_SECRET, { algorithms: ['HS256'] });
+  const payload = jwt.verify(token, config.JWT_REFRESH_SECRET, { algorithms: [""] });
 
   // Verify jti still valid (not revoked)
killedBy: POST /auth/refresh issues new accessToken with valid refresh cookie
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ObjectLiteral
src/features/auth/token.service.js:63:64
  * @returns {{ accessToken: string, refreshToken: string, expiresIn: number }}
  */
 export async function refreshTokens(token) {
-  const payload = jwt.verify(token, config.JWT_REFRESH_SECRET, { algorithms: ['HS256'] });
+  const payload = jwt.verify(token, config.JWT_REFRESH_SECRET, {});
 
   // Verify jti still valid (not revoked)
killedBy: issueTokens — refresh token jwt options (L31 ObjectLiteral killer) refresh token signed with HS384 is rejected by refreshTokens (algorithm enforced)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Killed] ConditionalExpression
src/features/auth/token.service.js:66:7
   const payload = jwt.verify(token, config.JWT_REFRESH_SECRET, { algorithms: ['HS256'] });
 
   // Verify jti still valid (not revoked)
-  if (!payload.jti) throw new Error('Missing refresh token id');
+  if (false) throw new Error('Missing refresh token id');
 
   try {
killedBy: refreshTokens — missing jti (line 66) throws when refresh token has no jti field
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Killed] ConditionalExpression
src/features/auth/token.service.js:66:7
   const payload = jwt.verify(token, config.JWT_REFRESH_SECRET, { algorithms: ['HS256'] });
 
   // Verify jti still valid (not revoked)
-  if (!payload.jti) throw new Error('Missing refresh token id');
+  if (true) throw new Error('Missing refresh token id');
 
   try {
killedBy: POST /auth/refresh issues new accessToken with valid refresh cookie
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BlockStatement
src/features/auth/token.service.js:68:7
   // Verify jti still valid (not revoked)
   if (!payload.jti) throw new Error('Missing refresh token id');
 
-  try {
-    const exists = await cacheGet(`rt:${payload.jti}`);
-    if (!exists) throw new Error('Refresh token revoked');
-  } catch (err) {
+  try {} catch (err) {
     log.warn({ err: err.message }, 'Refresh token validation failed');
     throw err;
killedBy: refreshTokens — revoked token throws when cacheGet returns null (revoked)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Killed] StringLiteral
src/features/auth/token.service.js:69:35
   if (!payload.jti) throw new Error('Missing refresh token id');
 
   try {
-    const exists = await cacheGet(`rt:${payload.jti}`);
+    const exists = await cacheGet(``);
     if (!exists) throw new Error('Refresh token revoked');
   } catch (err) {
killedBy: POST /auth/refresh issues new accessToken with valid refresh cookie
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/features/auth/token.service.js:70:9
 
   try {
     const exists = await cacheGet(`rt:${payload.jti}`);
-    if (!exists) throw new Error('Refresh token revoked');
+    if (true) throw new Error('Refresh token revoked');
   } catch (err) {
     log.warn({ err: err.message }, 'Refresh token validation failed');
killedBy: POST /auth/refresh issues new accessToken with valid refresh cookie
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BooleanLiteral
src/features/auth/token.service.js:70:9
 
   try {
     const exists = await cacheGet(`rt:${payload.jti}`);
-    if (!exists) throw new Error('Refresh token revoked');
+    if (exists) throw new Error('Refresh token revoked');
   } catch (err) {
     log.warn({ err: err.message }, 'Refresh token validation failed');
killedBy: POST /auth/refresh issues new accessToken with valid refresh cookie
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BlockStatement
src/features/auth/token.service.js:71:17
   try {
     const exists = await cacheGet(`rt:${payload.jti}`);
     if (!exists) throw new Error('Refresh token revoked');
-  } catch (err) {
-    log.warn({ err: err.message }, 'Refresh token validation failed');
-    throw err;
-  }
+  } catch (err) {}
 
   // Rotate: issue new pair, persist new jti, remove old jti
killedBy: refreshTokens cache validation log.warn (L72 killers) log.warn includes { err } when cacheGet throws (L72 ObjectLiteral)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Killed] ObjectLiteral
src/features/auth/token.service.js:72:14
     const exists = await cacheGet(`rt:${payload.jti}`);
     if (!exists) throw new Error('Refresh token revoked');
   } catch (err) {
-    log.warn({ err: err.message }, 'Refresh token validation failed');
+    log.warn({}, 'Refresh token validation failed');
     throw err;
   }
killedBy: refreshTokens cache validation log.warn (L72 killers) log.warn includes { err } when cacheGet throws (L72 ObjectLiteral)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"err": "Cache unavailable"}, Any<String>
Received: {}, "Refresh token validation failed"

Number of calls: 1

[Killed] BlockStatement
src/features/auth/token.service.js:79:7
   // Rotate: issue new pair, persist new jti, remove old jti
   const newTokens = await issueTokens({ sub: payload.sub });
 
-  try {
-    // Delete old jti
-    await cacheDel(`rt:${payload.jti}`);
-  } catch (err) {
+  try {} catch (err) {
     log.warn({ err: err.message }, 'Failed to delete old refresh jti');
   }
killedBy: refreshTokens cacheDel failure logging (L82/L83 killers) log.warn called when cacheDel throws (L82 BlockStatement)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/features/auth/token.service.js:82:17
   try {
     // Delete old jti
     await cacheDel(`rt:${payload.jti}`);
-  } catch (err) {
-    log.warn({ err: err.message }, 'Failed to delete old refresh jti');
-  }
+  } catch (err) {}
 
   return newTokens;
killedBy: refreshTokens cacheDel failure logging (L82/L83 killers) log.warn called when cacheDel throws (L82 BlockStatement)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
src/features/auth/token.service.js:83:14
     // Delete old jti
     await cacheDel(`rt:${payload.jti}`);
   } catch (err) {
-    log.warn({ err: err.message }, 'Failed to delete old refresh jti');
+    log.warn({}, 'Failed to delete old refresh jti');
   }
 
killedBy: refreshTokens cacheDel failure logging (L82/L83 killers) log.warn includes { err: err.message } on cacheDel failure (L83 ObjectLiteral)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"err": "ETIMEDOUT"}, Any<String>
Received: {}, "Failed to delete old refresh jti"

Number of calls: 1
