[Killed] Regex
src/services/claude.client.js:135:32
 
   const mTime    = lower.match(/(\d{1,2})[h:](\d{0,2})/);
   const time     = mTime ? `${mTime[1]}:${(mTime[2] || '00').padStart(2, '0')}` : '';
-  const mDate    = lower.match(/(aujourd'hui|demain|lundi|mardi|mercredi|jeudi|vendredi|samedi|dimanche|\d{1,2}\/\d{1,2})/);
+  const mDate    = lower.match(/(aujourd'hui|demain|lundi|mardi|mercredi|jeudi|vendredi|samedi|dimanche|\d{1,2}\/\d)/);
   let   date     = '';
   if (mDate) {
killedBy: _ruleBased date parsing (L133-146 killers) dd/mm format → correct ISO date (L143 Regex killers)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2026-06-15"
Received: "2025-12-15"

[Survived] StringLiteral
src/services/claude.client.js:136:20
   const mTime    = lower.match(/(\d{1,2})[h:](\d{0,2})/);
   const time     = mTime ? `${mTime[1]}:${(mTime[2] || '00').padStart(2, '0')}` : '';
   const mDate    = lower.match(/(aujourd'hui|demain|lundi|mardi|mercredi|jeudi|vendredi|samedi|dimanche|\d{1,2}\/\d{1,2})/);
-  let   date     = '';
+  let   date     = "Stryker was here!";
   if (mDate) {
     const d   = mDate[1];

[Killed] ConditionalExpression
src/services/claude.client.js:137:7
   const time     = mTime ? `${mTime[1]}:${(mTime[2] || '00').padStart(2, '0')}` : '';
   const mDate    = lower.match(/(aujourd'hui|demain|lundi|mardi|mercredi|jeudi|vendredi|samedi|dimanche|\d{1,2}\/\d{1,2})/);
   let   date     = '';
-  if (mDate) {
+  if (true) {
     const d   = mDate[1];
     const now = new Date();
killedBy: _isRetryable — retry count killers (L45-48) HttpError 5xx IS retried: exec called 3 times (1 + 2 retries)
statusReason: TypeError: Cannot read properties of null (reading '1')

[Killed] BlockStatement
src/services/claude.client.js:137:14
   const time     = mTime ? `${mTime[1]}:${(mTime[2] || '00').padStart(2, '0')}` : '';
   const mDate    = lower.match(/(aujourd'hui|demain|lundi|mardi|mercredi|jeudi|vendredi|samedi|dimanche|\d{1,2}\/\d{1,2})/);
   let   date     = '';
-  if (mDate) {
-    const d   = mDate[1];
-    const now = new Date();
-    if (d === "aujourd'hui") {
-      date = now.toISOString().slice(0, 10);
-    } else if (d === 'demain') {
-      const dt = new Date(now); dt.setDate(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
-    } else if (/\d{1,2}\/\d{1,2}/.test(d)) {
-      const [day, month] = d.split('/');
-      date = new Date(now.getFullYear(), Number(month) - 1, Number(day)).toISOString().slice(0, 10);
-    }
-  }
+  if (mDate) {}
   const mSubject = lower.match(/(?:pour |avec |concernant )(.+?)(?: à | au | en | le |$)/);
   return {
killedBy: _ruleBased date parsing (L133-146 killers) "demain" → tomorrow's date (L135 StringLiteral)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2026-05-20"
Received: ""

[Killed] BlockStatement
src/services/claude.client.js:140:30
   if (mDate) {
     const d   = mDate[1];
     const now = new Date();
-    if (d === "aujourd'hui") {
-      date = now.toISOString().slice(0, 10);
-    } else if (d === 'demain') {
+    if (d === "aujourd'hui") {} else if (d === 'demain') {
       const dt = new Date(now); dt.setDate(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
     } else if (/\d{1,2}\/\d{1,2}/.test(d)) {
killedBy: _ruleBased date parsing (L133-146 killers) "aujourd'hui" → today's date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2026-05-19"
Received: ""

[Killed] ConditionalExpression
src/services/claude.client.js:140:9
   if (mDate) {
     const d   = mDate[1];
     const now = new Date();
-    if (d === "aujourd'hui") {
+    if (true) {
       date = now.toISOString().slice(0, 10);
     } else if (d === 'demain') {
killedBy: analyze — no API key → rule-based extracts "demain" as tomorrow date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2026-05-20"
Received: "2026-05-19"

[Killed] MethodExpression
src/services/claude.client.js:141:14
     const d   = mDate[1];
     const now = new Date();
     if (d === "aujourd'hui") {
-      date = now.toISOString().slice(0, 10);
+      date = now.toISOString();
     } else if (d === 'demain') {
       const dt = new Date(now); dt.setDate(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
killedBy: _ruleBased — "aujourd'hui" date branch (line 137) sets date to today when text contains "aujourd'hui"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2026-05-19"
Received: "2026-05-19T18:57:33.692Z"

[Killed] EqualityOperator
src/services/claude.client.js:142:16
     const now = new Date();
     if (d === "aujourd'hui") {
       date = now.toISOString().slice(0, 10);
-    } else if (d === 'demain') {
+    } else if (d !== 'demain') {
       const dt = new Date(now); dt.setDate(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
     } else if (/\d{1,2}\/\d{1,2}/.test(d)) {
killedBy: _ruleBased date parsing (L133-146 killers) "demain" → tomorrow's date (L135 StringLiteral)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2026-05-20"
Received: ""

[Killed] ConditionalExpression
src/services/claude.client.js:142:16
     const now = new Date();
     if (d === "aujourd'hui") {
       date = now.toISOString().slice(0, 10);
-    } else if (d === 'demain') {
+    } else if (false) {
       const dt = new Date(now); dt.setDate(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
     } else if (/\d{1,2}\/\d{1,2}/.test(d)) {
killedBy: analyze — no API key → rule-based extracts "demain" as tomorrow date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2026-05-20"
Received: ""

[Killed] MethodExpression
src/services/claude.client.js:143:33
     if (d === "aujourd'hui") {
       date = now.toISOString().slice(0, 10);
     } else if (d === 'demain') {
-      const dt = new Date(now); dt.setDate(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
+      const dt = new Date(now); dt.setTime(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
     } else if (/\d{1,2}\/\d{1,2}/.test(d)) {
       const [day, month] = d.split('/');
killedBy: analyze — no API key → rule-based extracts "demain" as tomorrow date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2026-05-20"
Received: "1970-01-01"

[Killed] ArithmeticOperator
src/services/claude.client.js:143:44
     if (d === "aujourd'hui") {
       date = now.toISOString().slice(0, 10);
     } else if (d === 'demain') {
-      const dt = new Date(now); dt.setDate(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
+      const dt = new Date(now); dt.setDate(dt.getDate() - 1); date = dt.toISOString().slice(0, 10);
     } else if (/\d{1,2}\/\d{1,2}/.test(d)) {
       const [day, month] = d.split('/');
killedBy: analyze — no API key → rule-based extracts "demain" as tomorrow date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2026-05-20"
Received: "2026-05-18"

[Killed] BlockStatement
src/services/claude.client.js:144:44
       date = now.toISOString().slice(0, 10);
     } else if (d === 'demain') {
       const dt = new Date(now); dt.setDate(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
-    } else if (/\d{1,2}\/\d{1,2}/.test(d)) {
-      const [day, month] = d.split('/');
-      date = new Date(now.getFullYear(), Number(month) - 1, Number(day)).toISOString().slice(0, 10);
-    }
+    } else if (/\d{1,2}\/\d{1,2}/.test(d)) {}
   }
   const mSubject = lower.match(/(?:pour |avec |concernant )(.+?)(?: à | au | en | le |$)/);
killedBy: analyze — no API key → rule-based extracts DD/MM date
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^\d{4}-06-15$/
Received string:  ""

[Killed] ConditionalExpression
src/services/claude.client.js:144:16
       date = now.toISOString().slice(0, 10);
     } else if (d === 'demain') {
       const dt = new Date(now); dt.setDate(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
-    } else if (/\d{1,2}\/\d{1,2}/.test(d)) {
+    } else if (true) {
       const [day, month] = d.split('/');
       date = new Date(now.getFullYear(), Number(month) - 1, Number(day)).toISOString().slice(0, 10);
killedBy: analyze — no API key → rule-based detects update_event from "modifier"
statusReason: RangeError: Invalid time value

[Killed] StringLiteral
src/services/claude.client.js:145:36
     } else if (d === 'demain') {
       const dt = new Date(now); dt.setDate(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
     } else if (/\d{1,2}\/\d{1,2}/.test(d)) {
-      const [day, month] = d.split('/');
+      const [day, month] = d.split("");
       date = new Date(now.getFullYear(), Number(month) - 1, Number(day)).toISOString().slice(0, 10);
     }
killedBy: analyze — no API key → rule-based extracts DD/MM date
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^\d{4}-06-15$/
Received string:  "2026-05-01"

[Killed] MethodExpression
src/services/claude.client.js:146:14
       const dt = new Date(now); dt.setDate(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
     } else if (/\d{1,2}\/\d{1,2}/.test(d)) {
       const [day, month] = d.split('/');
-      date = new Date(now.getFullYear(), Number(month) - 1, Number(day)).toISOString().slice(0, 10);
+      date = new Date(now.getFullYear(), Number(month) - 1, Number(day)).toISOString();
     }
   }
killedBy: analyze — no API key → rule-based extracts DD/MM date
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^\d{4}-06-15$/
Received string:  "2026-06-15T04:00:00.000Z"

[Killed] ArithmeticOperator
src/services/claude.client.js:146:42
       const dt = new Date(now); dt.setDate(dt.getDate() + 1); date = dt.toISOString().slice(0, 10);
     } else if (/\d{1,2}\/\d{1,2}/.test(d)) {
       const [day, month] = d.split('/');
-      date = new Date(now.getFullYear(), Number(month) - 1, Number(day)).toISOString().slice(0, 10);
+      date = new Date(now.getFullYear(), Number(month) + 1, Number(day)).toISOString().slice(0, 10);
     }
   }
killedBy: analyze — no API key → rule-based extracts DD/MM date
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^\d{4}-06-15$/
Received string:  "2026-08-15"

[Killed] OptionalChaining
src/services/claude.client.js:152:17
   const mSubject = lower.match(/(?:pour |avec |concernant )(.+?)(?: à | au | en | le |$)/);
   return {
     intent,
-    subject:    mSubject?.[1]?.trim() ?? '',
+    subject:    mSubject[1]?.trim() ?? '',
     date,
     time,
killedBy: CircuitOpenError paths — lines 44, 51, 57 call 1: 3 network failures (consecutive count reaches 3)
statusReason: TypeError: Cannot read properties of null (reading '1')

[Killed] MethodExpression
src/services/claude.client.js:152:17
   const mSubject = lower.match(/(?:pour |avec |concernant )(.+?)(?: à | au | en | le |$)/);
   return {
     intent,
-    subject:    mSubject?.[1]?.trim() ?? '',
+    subject:    mSubject?.[1] ?? '',
     date,
     time,
killedBy: _ruleBased subject and confidence (L148-155 killers) subject trimmed (L151 MethodExpression + OptionalChaining)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "marie"
Received: " marie "

[Killed] EqualityOperator
src/services/claude.client.js:155:17
     subject:    mSubject?.[1]?.trim() ?? '',
     date,
     time,
-    confidence: intent === 'unknown' ? 0.25 : 0.85,
+    confidence: intent !== 'unknown' ? 0.25 : 0.85,
     errors:     [],
     strategy:   'rule-based',
killedBy: _ruleBased subject and confidence (L148-155 killers) unknown intent → confidence 0.25 (L154 ConditionalExpression killer)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.25
Received: 0.85

[Killed] ConditionalExpression
src/services/claude.client.js:155:17
     subject:    mSubject?.[1]?.trim() ?? '',
     date,
     time,
-    confidence: intent === 'unknown' ? 0.25 : 0.85,
+    confidence: false ? 0.25 : 0.85,
     errors:     [],
     strategy:   'rule-based',
killedBy: analyze — no API key → rule-based returns unknown with confidence 0.25 for unrecognized text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.25
Received: 0.85

[Killed] StringLiteral
src/services/claude.client.js:157:17
     time,
     confidence: intent === 'unknown' ? 0.25 : 0.85,
     errors:     [],
-    strategy:   'rule-based',
+    strategy:   "",
   };
 }
killedBy: analyze — no API key → rule-based strategy is "rule-based"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rule-based"
Received: ""

[Killed] OptionalChaining
src/services/claude.client.js:175:8
  * @returns {Promise<object>}
  */
 export async function analyze(text, opts = {}) {
-  if (!text?.trim()) {
+  if (!text.trim()) {
     return { intent: 'unknown', subject: '', date: '', time: '', confidence: 0, errors: ['empty-input'], strategy: 'none' };
   }
killedBy: analyze — empty/null input returns intent:unknown for null
statusReason: TypeError: Cannot read properties of null (reading 'trim')

[Killed] MethodExpression
src/services/claude.client.js:175:8
  * @returns {Promise<object>}
  */
 export async function analyze(text, opts = {}) {
-  if (!text?.trim()) {
+  if (!text) {
     return { intent: 'unknown', subject: '', date: '', time: '', confidence: 0, errors: ['empty-input'], strategy: 'none' };
   }
killedBy: analyze — empty/null input returns intent:unknown for whitespace
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unknown"
Received: "list_events"

[Killed] ArrayDeclaration
src/services/claude.client.js:176:89
  */
 export async function analyze(text, opts = {}) {
   if (!text?.trim()) {
-    return { intent: 'unknown', subject: '', date: '', time: '', confidence: 0, errors: ['empty-input'], strategy: 'none' };
+    return { intent: 'unknown', subject: '', date: '', time: '', confidence: 0, errors: [], strategy: 'none' };
   }
 
killedBy: analyze — empty/null input returns intent:unknown for empty string
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "empty-input"
Received array: []

[Killed] ObjectLiteral
src/services/claude.client.js:176:12
  */
 export async function analyze(text, opts = {}) {
   if (!text?.trim()) {
-    return { intent: 'unknown', subject: '', date: '', time: '', confidence: 0, errors: ['empty-input'], strategy: 'none' };
+    return {};
   }
 
killedBy: INVARIANT 2: empty/null inputs always return intent:unknown null → intent:unknown
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unknown"
Received: undefined

[Killed] LogicalOperator
src/services/claude.client.js:180:7
   }
 
   const claudeEnabled = await isEnabled(FLAGS.CLAUDE_NLU);
-  if (!config.CLAUDE_API_KEY || breaker.getState() === STATE.OPEN || !claudeEnabled) {
+  if (!config.CLAUDE_API_KEY && breaker.getState() === STATE.OPEN || !claudeEnabled) {
     log.debug({ requestId: opts.requestId, state: breaker.getState(), claudeEnabled }, 'Claude NLU unavailable — rule-based fallback');
     return _ruleBased(text);
killedBy: analyze — circuit OPEN → rule-based returns rule-based when circuit is OPEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rule-based"
Received: "claude"

[Killed] EqualityOperator
src/services/claude.client.js:180:33
   }
 
   const claudeEnabled = await isEnabled(FLAGS.CLAUDE_NLU);
-  if (!config.CLAUDE_API_KEY || breaker.getState() === STATE.OPEN || !claudeEnabled) {
+  if (!config.CLAUDE_API_KEY || breaker.getState() !== STATE.OPEN || !claudeEnabled) {
     log.debug({ requestId: opts.requestId, state: breaker.getState(), claudeEnabled }, 'Claude NLU unavailable — rule-based fallback');
     return _ruleBased(text);
killedBy: CircuitOpenError paths — lines 44, 51, 57 call 1: 3 network failures (consecutive count reaches 3)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "claude", "network"

Number of calls: 0

[Killed] LogicalOperator
src/services/claude.client.js:185:18
     return _ruleBased(text);
   }
 
-  const model  = opts.model ?? config.CLAUDE_MODEL;
+  const model  = opts.model && config.CLAUDE_MODEL;
   const system =
     'Tu es un extracteur NLU. Retourne UNIQUEMENT une ligne JSON valide avec : ' +
killedBy: analyze body — opts.model and temperature (L184/L194 killers) no opts.model → config.CLAUDE_MODEL used in API body (L184 LogicalOperator)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "claude-haiku-4-5-20251001"
Received: undefined

[Killed] StringLiteral
src/services/claude.client.js:187:5
 
   const model  = opts.model ?? config.CLAUDE_MODEL;
   const system =
-    'Tu es un extracteur NLU. Retourne UNIQUEMENT une ligne JSON valide avec : ' +
+    "" +
     'intent (create_event|cancel_event|update_event|list_events|unknown), subject (string), ' +
     'date (ex: "demain", "lundi", "2026-04-10"), time (ex: "14h30", "09:00"), ' +
killedBy: analyze API body — system prompt + messages (L186-197 killers) system prompt contains NLU instruction keywords (L186-189)
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "extracteur NLU"
Received string:    "intent (create_event|cancel_event|update_event|list_events|unknown), subject (string), date (ex: \"demain\", \"lundi\", \"2026-04-10\"), time (ex: \"14h30\", \"09:00\"), confidence (number 0-1), errors (array), strategy (string). Rien d'autre que le JSON."

[Survived] StringLiteral
src/services/claude.client.js:189:5
   const system =
     'Tu es un extracteur NLU. Retourne UNIQUEMENT une ligne JSON valide avec : ' +
     'intent (create_event|cancel_event|update_event|list_events|unknown), subject (string), ' +
-    'date (ex: "demain", "lundi", "2026-04-10"), time (ex: "14h30", "09:00"), ' +
+    "" +
     'confidence (number 0-1), errors (array), strategy (string). Rien d\'autre que le JSON.';
 

[Killed] LogicalOperator
src/services/claude.client.js:195:20
   try {
     const json = await _call({
       model, max_tokens: 256,
-      temperature: opts.temperature ?? 0,
+      temperature: opts.temperature && 0,
       system,
       messages: [{ role: 'user', content: `Texte à analyser : "${_escJson(text)}"` }],
killedBy: analyze body — opts.model and temperature (L184/L194 killers) no opts.temperature → temperature=0 in body (L194 LogicalOperator)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] StringLiteral
src/services/claude.client.js:197:43
       model, max_tokens: 256,
       temperature: opts.temperature ?? 0,
       system,
-      messages: [{ role: 'user', content: `Texte à analyser : "${_escJson(text)}"` }],
+      messages: [{ role: 'user', content: `` }],
     }, { requestId: opts.requestId });
 
killedBy: _escJson special-char escaping (L40-41 killers) double-quote in text is escaped as \" in content (L41 StringLiteral \")
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\\\"urgent\\\""
Received string:    ""

[Killed] LogicalOperator
src/services/claude.client.js:200:18
       messages: [{ role: 'user', content: `Texte à analyser : "${_escJson(text)}"` }],
     }, { requestId: opts.requestId });
 
-    const raw = (json.content?.[0]?.text ?? '')
+    const raw = (json.content?.[0]?.text && '')
       .trim().replace(/^```json?\n?/i, '').replace(/\n?```$/, '').trim();
 
killedBy: analyze — content OptionalChaining + Regex (L199-200 killers) ```json wrapper is stripped before parse (L200 Regex)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "claude"
Received: "rule-based"

[Survived] OptionalChaining
src/services/claude.client.js:200:18
       messages: [{ role: 'user', content: `Texte à analyser : "${_escJson(text)}"` }],
     }, { requestId: opts.requestId });
 
-    const raw = (json.content?.[0]?.text ?? '')
+    const raw = (json.content[0]?.text ?? '')
       .trim().replace(/^```json?\n?/i, '').replace(/\n?```$/, '').trim();
 

[Killed] StringLiteral
src/services/claude.client.js:201:40
     }, { requestId: opts.requestId });
 
     const raw = (json.content?.[0]?.text ?? '')
-      .trim().replace(/^```json?\n?/i, '').replace(/\n?```$/, '').trim();
+      .trim().replace(/^```json?\n?/i, "Stryker was here!").replace(/\n?```$/, '').trim();
 
     let parsed;
killedBy: analyze — content OptionalChaining + Regex (L199-200 killers) ```json wrapper is stripped before parse (L200 Regex)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "claude"
Received: "rule-based"

[Killed] BlockStatement
src/services/claude.client.js:204:9
       .trim().replace(/^```json?\n?/i, '').replace(/\n?```$/, '').trim();
 
     let parsed;
-    try {
-      parsed = JSON.parse(raw.split('\n')[0]);
-    } catch {
+    try {} catch {
       log.warn({ requestId: opts.requestId, raw: raw.slice(0, 200) }, 'Claude JSON parse failed — rule-based fallback');
       return _ruleBased(text);
killedBy: analyze — Claude API success returns parsed intent from Claude response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Dentiste"
Received: ""

[Killed] BlockStatement
src/services/claude.client.js:206:13
     let parsed;
     try {
       parsed = JSON.parse(raw.split('\n')[0]);
-    } catch {
-      log.warn({ requestId: opts.requestId, raw: raw.slice(0, 200) }, 'Claude JSON parse failed — rule-based fallback');
-      return _ruleBased(text);
-    }
+    } catch {}
 
     return {
killedBy: analyze — JSON parse failure log (L205-206 killers) parse failure log includes raw content (L206 ObjectLiteral)
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] MethodExpression
src/services/claude.client.js:207:50
     try {
       parsed = JSON.parse(raw.split('\n')[0]);
     } catch {
-      log.warn({ requestId: opts.requestId, raw: raw.slice(0, 200) }, 'Claude JSON parse failed — rule-based fallback');
+      log.warn({ requestId: opts.requestId, raw: raw }, 'Claude JSON parse failed — rule-based fallback');
       return _ruleBased(text);
     }

[Killed] StringLiteral
src/services/claude.client.js:207:71
     try {
       parsed = JSON.parse(raw.split('\n')[0]);
     } catch {
-      log.warn({ requestId: opts.requestId, raw: raw.slice(0, 200) }, 'Claude JSON parse failed — rule-based fallback');
+      log.warn({ requestId: opts.requestId, raw: raw.slice(0, 200) }, "");
       return _ruleBased(text);
     }
killedBy: analyze — JSON parse failure log (L205-206 killers) parse failure log message is "Claude JSON parse failed..." (L206 StringLiteral)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/services/claude.client.js:212:19
     }
 
     return {
-      intent:     parsed.intent     ?? 'unknown',
+      intent:     parsed.intent && 'unknown',
       subject:    parsed.subject    ?? '',
       date:       parsed.date       ?? '',
killedBy: analyze — content OptionalChaining + Regex (L199-200 killers) ```json wrapper is stripped before parse (L200 Regex)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "create_event"
Received: "unknown"

[Killed] StringLiteral
src/services/claude.client.js:212:40
     }
 
     return {
-      intent:     parsed.intent     ?? 'unknown',
+      intent:     parsed.intent     ?? "",
       subject:    parsed.subject    ?? '',
       date:       parsed.date       ?? '',
killedBy: analyze — parsed field ?? fallbacks (L211-217 killers) missing intent → "unknown"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unknown"
Received: ""

[Killed] LogicalOperator
src/services/claude.client.js:213:19
 
     return {
       intent:     parsed.intent     ?? 'unknown',
-      subject:    parsed.subject    ?? '',
+      subject:    parsed.subject && '',
       date:       parsed.date       ?? '',
       time:       parsed.time       ?? '',
killedBy: analyze — parsed field ?? fallbacks (L211-217 killers) missing subject → ""
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: undefined

[Killed] StringLiteral
src/services/claude.client.js:213:40
 
     return {
       intent:     parsed.intent     ?? 'unknown',
-      subject:    parsed.subject    ?? '',
+      subject:    parsed.subject    ?? "Stryker was here!",
       date:       parsed.date       ?? '',
       time:       parsed.time       ?? '',
killedBy: analyze — parsed field ?? fallbacks (lines 207-213) uses "unknown" when parsed.intent is null/undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] LogicalOperator
src/services/claude.client.js:214:19
     return {
       intent:     parsed.intent     ?? 'unknown',
       subject:    parsed.subject    ?? '',
-      date:       parsed.date       ?? '',
+      date:       parsed.date && '',
       time:       parsed.time       ?? '',
       confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.8,
killedBy: analyze — parsed field ?? fallbacks (lines 207-213) uses "unknown" when parsed.intent is null/undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: undefined

[Killed] StringLiteral
src/services/claude.client.js:214:40
     return {
       intent:     parsed.intent     ?? 'unknown',
       subject:    parsed.subject    ?? '',
-      date:       parsed.date       ?? '',
+      date:       parsed.date       ?? "Stryker was here!",
       time:       parsed.time       ?? '',
       confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.8,
killedBy: analyze — parsed field ?? fallbacks (lines 207-213) uses "unknown" when parsed.intent is null/undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] LogicalOperator
src/services/claude.client.js:215:19
       intent:     parsed.intent     ?? 'unknown',
       subject:    parsed.subject    ?? '',
       date:       parsed.date       ?? '',
-      time:       parsed.time       ?? '',
+      time:       parsed.time && '',
       confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.8,
       errors:     parsed.errors     ?? [],
killedBy: analyze — parsed field ?? fallbacks (lines 207-213) uses "unknown" when parsed.intent is null/undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: undefined

[Killed] EqualityOperator
src/services/claude.client.js:216:19
       subject:    parsed.subject    ?? '',
       date:       parsed.date       ?? '',
       time:       parsed.time       ?? '',
-      confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.8,
+      confidence: typeof parsed.confidence !== 'number' ? parsed.confidence : 0.8,
       errors:     parsed.errors     ?? [],
       strategy:   parsed.strategy   ?? 'claude',
killedBy: analyze — parsed field ?? fallbacks (lines 207-213) uses 0.8 when parsed.confidence is not a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.8
Received: "high"

[Killed] ConditionalExpression
src/services/claude.client.js:216:19
       subject:    parsed.subject    ?? '',
       date:       parsed.date       ?? '',
       time:       parsed.time       ?? '',
-      confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.8,
+      confidence: false ? parsed.confidence : 0.8,
       errors:     parsed.errors     ?? [],
       strategy:   parsed.strategy   ?? 'claude',
killedBy: analyze — parsed field ?? fallbacks (L211-217 killers) confidence is number → used as-is
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.95
Received: 0.8

[Killed] LogicalOperator
src/services/claude.client.js:217:19
       date:       parsed.date       ?? '',
       time:       parsed.time       ?? '',
       confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.8,
-      errors:     parsed.errors     ?? [],
+      errors:     parsed.errors && [],
       strategy:   parsed.strategy   ?? 'claude',
     };
killedBy: analyze — parsed field ?? fallbacks (lines 207-213) uses empty array when parsed.errors is null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/services/claude.client.js:218:19
       time:       parsed.time       ?? '',
       confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.8,
       errors:     parsed.errors     ?? [],
-      strategy:   parsed.strategy   ?? 'claude',
+      strategy:   parsed.strategy && 'claude',
     };
   } catch (err) {
killedBy: analyze — parsed field ?? fallbacks (L211-217 killers) missing strategy → "claude"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "claude"
Received: undefined

[Timeout] StringLiteral
src/services/claude.client.js:218:40
       time:       parsed.time       ?? '',
       confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.8,
       errors:     parsed.errors     ?? [],
-      strategy:   parsed.strategy   ?? 'claude',
+      strategy:   parsed.strategy   ?? "",
     };
   } catch (err) {
